SET NAMES UTF8;
DROP DATABASE IF EXISTS ylc;
CREATE DATABASE ylc CHARSET=UTF8;
USE ylc;

/* 首页列表 */
/* 注册信息和会员信息表*/
-- 产品列表
CREATE TABLE ylc_index(
  id INT PRIMARY KEY AUTO_INCREMENT,
  headline VARCHAR(32),   #大标题
  pic VARCHAR(128),    #图片
  href VARCHAR(128),   #链接
  label VARCHAR(16),   #左标签
  rlabel VARCHAR(16),  #右标签
  title VARCHAR(32),   #标题
  lately VARCHAR(16),  #近期出发时间
  snumber VARCHAR(32), #编号
  site VARCHAR(32),    #地点
  route VARCHAR(32),   #行程
  price INT,   #价格
  oprice  INT,   #原始价格
  exist VARCHAR(1),    #是否在售  0否 1在售
  pid INT              #分类编号
);

/* 首页当季最热 */
INSERT INTO ylc_index VALUES
(NUll,'当季最热','img/index/57ce3d81e2d73.jpg','product.html','','','','','','','','','','',1),
(NUll,'当季最热','img/index/58295ad926c81.jpg','product.html','','','','','','','','','','',1),
(NUll,'当季最热','img/index/5b7f770ab3fbf.jpg','product.html','','','','','','','','','','',1),
(NUll,'当季最热','img/index/596eb127bb23a.jpg','product.html','','','','','','','','','','',1),
-- /出境游/
(NUll,'出境游','img/index/5a93b7b7a17c1.jpg','product','跟团游','','芽庄4晚5日游（VJ直飞，提前报名四星酒店可免费升级2晚海边5星酒店，经典市区游+美人湾，.....','','GTY1426','杭州','5天4晚','0',2584,'0',2),
(NUll,'出境游','img/index/5bd95898043ce.jpg','product','跟团游','','【寒假】【2人立减500】北海道粉雪北国3晚4日游（HU，升级温...','','GTY1426','杭州','4天3晚','0',7148,'0',2),
(NUll,'出境游','img/index/599f98d62e5af.jpg','product','跟团游','','【4人减1000】极光-莫斯科+摩尔曼斯克+圣彼得堡6晚9天（J...','','GTY1837','杭州','5天4晚','0',1299,'0',2),
(NUll,'出境游','img/index/587f2ba337f07.png','product','跟团游','','长滩岛4晚5日半自助（BK直飞，随机三星四星酒店，爱马仕航班，拒...','','GTY1804','杭州','5天4晚','0',3508,'0',2),
(NUll,'出境游','img/index/5c6e1f1371257.jpg','product','游轮','2019-06-27','【超值预售】6.27皇家加勒比“海洋光谱号”上海-长崎-福冈-上...','','YL2380','杭州','6天5晚',4599,5978,'1',2),
-- 周边游
(NUll,'周边游','img/index/599f98d62e5af.jpg','product','当地玩乐','','【寒假】上海迪士尼自由行2日游含2日入园门票纯玩无购物宿舒适酒店...','','BD2059','不限出发地','2天1晚','0',1258,'0',3),
(NUll,'周边游','img/index/59cc69da2aafb.jpg','product','当地玩乐','','【寒假】上海迪士尼自由行2日游含1日入园门票纯玩无购物宿舒适酒店...','','BD2191','不限出发地','2天1晚','0',777,'0',3),
(NUll,'周边游','img/index/5a1537c66b9b0.jpg','product','跟团游','','【寒假】普陀2日自由行（代订车位+住宿）','','ZYX2127','杭州','2天1晚','0',325,'0',3),
-- 国内游
(NUll,'国内游','img/index/5816b201b22a2.png','product','跟团游','2019-04-22','【寒假】【私家团】云南西双版纳+勐仑4晚5日纯玩游（双飞，2人起...','','GTY1804','杭州','5天4晚',4800,6240,'0',3),
(NUll,'国内游','img/index/59f96ea2b07d3.jpg','product','自由行','2019-04-22','厦门5晚6日自由行（双飞、网评五星、精彩旅程 )','2019-04-20','ZYX0623','杭州','5天4晚','1',3080,'1',3),
(NUll,'国内游','img/index/5bd820583c000.jpg','product','跟团游','2019-04-22','哈尔滨、东升穿越羊草山、中国雪乡、镜泊湖、长白山、万科滑雪、皇冠...','','GTY1128','杭州','7天6晚','0',5044,'0',3),
(NUll,'国内游','img/index/58d32f2de9c43.jpg','product','自由行','','【小东海系列】三亚4晚5日自由行（双飞，4晚五星酒店帆船港高级海...','','GTY1804','杭州','5天4晚','0',4394,'0',3),
(NUll,'国内游','img/index/595d9c5a33382.jpg','product','跟团游','','【错峰】广西北海银滩+涠洲岛+百年老街双飞4日游（0购物+升级一...','','GTY0712','杭州','4天3晚','0',3378,'0',3),
(NUll,'banner','img/index/59ffc8ce20917.jpg','product','','','','','','','','','','',3),

-- 当季最热详情页
(NUll,'当季最热','img/new_hot/59522209c16ea.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/5800522091104.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/5a12600f38847.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/58295ad90e08e.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/5b7f770a9de68.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/59479072784f8.jpg','product','','','','','','','','','','',5),
(NUll,'当季最热','img/new_hot/5947920102f38.jpg','product','','','','','','','','','','',5);
